STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Core/Src/k_window.c
/**
  ******************************************************************************
  * @file    k_window.c
  * @author  MCD Application Team
  * @brief   This file contains the Hex dumps of the images available
  ******************************************************************************
   * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l552e_eval_lcd.h"
#include "basic_gui.h"
#include "k_window.h"
#include "utils.h"

/* External variables --------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions ---------------------------------------------------------*/

/**
  * @brief  Handle a window display.
  * @param  title to display a message, \n is used for multiple line.
  * @param  title_tc : title text color.
  * @param  title_bc : title backgroun color.
  * @param  Msg to display a message, \n is used for multiple line.
  * @param  msg_tc : title text color.
  * @param  msg_bc : title backgroun color.
  * @retval None
  */
void kWindow_Popup(char *title, uint32_t title_tc, uint32_t title_bc ,char *Msg, uint32_t msg_tc, uint32_t msg_bc )
{
  uint32_t pXSize, pYSize;
  uint8_t substring[25];
  uint8_t lineindex;
  uint16_t index,subindex;

  /* Clear the LCD Screen */
  GUI_Clear(title_bc);
  GUI_SetBackColor(title_bc);
  GUI_SetTextColor(title_tc);

  /* Set the Back Color */
  GUI_SetFont(&GUI_DEFAULT_FONT);
  GUI_SetTextColor(title_tc);
  GUI_DisplayStringAt(0, 0, (uint8_t *)title, CENTER_MODE);

  /* Prepare the msg area */
  GUI_SetBackColor(msg_bc);
  GUI_SetTextColor(msg_bc);
  BSP_LCD_GetXSize(0, &pXSize);
  BSP_LCD_GetYSize(0, &pYSize);
  GUI_FillRect(0, GUI_DEFAULT_FONT.Height, pXSize, pYSize - GUI_DEFAULT_FONT.Height, msg_bc);
  GUI_SetTextColor(msg_tc);

  lineindex = subindex = index = 0;
  do
  {
    substring[subindex]=Msg[index];
    if((Msg[index] == '\n') || (Msg[subindex] == '\0'))
    {
      substring[subindex] = '\0';
      GUI_DisplayStringAt(0, (2+lineindex) * GUI_DEFAULT_FONT.Height, substring, CENTER_MODE);
      lineindex++;
      subindex = 0;
    }
    else
    {
      subindex++;
    }

    if(Msg[index] != '\0')
    {
      index++;
    }
  }
  while(Msg[index] != '\0');

}

/**
  * @brief  Handle a window display.
  * @param  msg   pointer to the message to display, \n is used for multiple line.
  * @retval None
  */
void kWindow_Error(char *msg)
{
  kWindow_Popup("Error popup", GUI_COLOR_BLACK, GUI_COLOR_RED,msg, GUI_COLOR_BLACK, GUI_COLOR_RED);
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
